app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("created_at", "updated_at", "name", "email", "datetime", "people", "message") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    respond_to do |format|
      if @booking.save