app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "updated_at", "name", "email", "subject", "message") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2024-07-30 08:38:54.711301"], ["updated_at", "2024-07-30 08:38:54.711301"], ["name", ""], ["email", ""], ["subject", ""], ["message", ""]]
---
  def create
    @contact = Contact.new(contact_params)
    respond_to do |format|
      if @contact.save