app/controllers/subscriptions_controller.rb

  def create
    @subscription = Subscription.new(subscription_params)

    respond_to do |format|
        if @subscription.save
---
INSERT INTO "subscriptions" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", ""], ["created_at", "2024-07-29 10:40:31.496557"], ["updated_at", "2024-07-29 10:40:31.496557"]]